# users.py

TEAMS = {
    1:  {
        "members": {
            775766895: "Кирилл Востриков",
            731869173: "Татьяна Воронкова",
            368455189: "Наталья Голощапова",
            949507228: "Марьяна Попова",
            220691670: "Алексей Хван",
            1348645453: "Виктория Моисеенко",
            168099024: "Айрат Каримов",
            946740162: "Александр Зайцев"
        },
        "managers": [728631150,775766895]
    },
    2: {
        "members": {
            8134384275: "Кирилл"
        },
        "managers": [8134384275]
    }
}

USERS = {}
for team in TEAMS.values():
    USERS.update(team["members"])