# users.py — Telegram users & teams
# chat_id -> ФИО
# Новые chat_id ты добавляешь вручную

TEAMS = {
    1: {
        "team_name": "Отдел развития цифровых каналов и сервисов",
        "tag": "Daily",
        "members": {
            731869173: "Татьяна Воронкова",
            368455189: "Наталья Голощапова",
            949507228: "Марьяна Попова",
            220691670: "Алексей Хван",
            1348645453: "Виктория Моисеенко",
            168099024: "Айрат Каримов",
            946740162: "Александр Зайцев"
        },
        "managers": [728631150,775766895],
    },
    2: {
        "team_name": "Отдел бизнес-анализа операций на финансовых рынках",
        "tag": "Daily",
        "members": {
            1010954244: "Константин Базаркин",
            398995895: "Антон Баронин",
            253240597: "Дмитрий Малютин",
            32063968: "Радмир Рахманкулов"
        },
        "managers": [185065172,775766895],
    },
    3: {
        "team_name": "Отдел бизнес-анализа брокерских операций",
        "tag": "Weekly",
        "members": {
           
        },
        "managers": [775766895],
    },
    4: {
        "team_name": "Отдел аналитики данных и неторговых операций",
        "tag": "Weekly",
        "members": {
            # chat_id: ФИО
        },
        "managers": [],
    },
}

# Плоский справочник
USERS = {}
for team in TEAMS.values():
    USERS.update(team["members"])