TEAMS = {
    1: {
        "team_name": "Отдел развития цифровых каналов и сервисов",
        "tag": "Daily",
        "members": {
            775766895: "Кирилл Востриков",
            731869173: "Татьяна Воронкова",
            368455189: "Наталья Голощапова",
            949507228: "Марьяна Попова",
            220691670: "Алексей Хван",
            1348645453: "Виктория Моисеенко",
            168099024: "Айрат Каримов",
            946740162: "Александр Зайцев"
        },
        "managers": [728631150,775766895],
    },
    2: {
        "team_name": "Отдел бизнес-анализа операций на финансовых рынках",
        "tag": "Daily",
        "members": {
            398995895: "Антон Баронин",
            253240597: "Дмитрий Малютин",
            32063968: "Радмир Рахманкулов",
            408853472: "Рената Урманова"
        },
        "managers": [185065172,775766895],
    },
    3: {
        "team_name": "Отдел бизнес-анализа брокерских операций",
        "tag": "Weekly",
        "members": {
            919758178: "Ирина Провоторова",
            5225467537: "Илья Вощенков",
            1113794924: "Константин Юрков",
            1868279811: "Екатерина Плотникова",
            1130113381: "Полина Плетнёва",
            777825681: "Екатерина Бахур",
            867695070: "Наталья Акиньшина",
            760854989: "Денис Еремин",
            676287943: "Екатерина Васильева"
        },
        "managers": [459566193,775766895],
    },
    4: {
        "team_name": "Отдел аналитики данных и неторговых операций",
        "tag": "Weekly",
        "members": {
            620927162: "Анастасия Пересыпкина",
            186342978: "Илья Лёвкин",
            833327410: "Азалия Масалимова",
            471161297: "Вячеслав Садовников",
            190686133: "Мария Юринок",
            1350817951: "Анна Нургалеева",
            914383297: "Борис Алёшин",
            135356696: "Владимир Баганов",
            414409290: "Юлия Райконен",
            89798561: "Дмитрий Ямщиков",
        },
        "managers": [309039450,775766895],
    },
}

USERS = {}
for team in TEAMS.values():
    USERS.update(team["members"])